Tekla.Structures.Model.RebarGroup.RebarGroupStirrupTypeEnum
The different stirrup types.

Tekla.Structures.Model.RebarGroup.RebarGroupStirrupTypeEnum.STIRRUP_TYPE_POLYGONAL
The polygonal type of stirrup.

Tekla.Structures.Model.RebarGroup.RebarGroupStirrupTypeEnum.STIRRUP_TYPE_SPIRAL
The spiral type of stirrup.

Tekla.Structures.Model.RebarGroup.RebarGroupStirrupTypeEnum.STIRRUP_TYPE_TAPERED_CURVED
The tapered curved type of stirrup. Three polygons have to be defined.